using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.IO;
using Tyuiu.ShtokerVN.Sprint5.Task5.V24.Lib;

namespace Tyuiu.ShtokerVN.Sprint5.Task5.V24
{
    class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #5 | Выполнил: Штокер В.Н. | ИИПб-23-1";

            Console.WriteLine("**************************************************************************************************************************************************************");
            Console.WriteLine("* Спринт #5                                                                                                                                                  *");
            Console.WriteLine("* Тема: Чтение набора данных из текстового файла                                                                                                             *");
            Console.WriteLine("* Задание #5                                                                                                                                                 *");
            Console.WriteLine("* Вариант #24                                                                                                                                                *");
            Console.WriteLine("* Выполнил: Штокер Владимир Николаевич  | ИИПб-23-1                                                                                                          *");
            Console.WriteLine("**************************************************************************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                                                                                   *");
            Console.WriteLine("* Найти сумму всех двузначных целых чисел в файле.  Полученный результат вывести на консоль. У вещественных значений округлить до трёх знаков после запятой. *");
            Console.WriteLine("**************************************************************************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                                                                           *");
            Console.WriteLine("**************************************************************************************************************************************************************");

            string path = @"C:\DataSprint5\InPutDataFileTask5V24.txt";

            Console.WriteLine("Данные находятся в файле: " + path);

            Console.WriteLine("**************************************************************************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                                                                 *");
            Console.WriteLine("**************************************************************************************************************************************************************");

            Console.WriteLine("Сумма всех двузначных целых чисел в файле: = " + ds.LoadFromDataFile(path));
            Console.ReadKey();
        }
    }
}
